Tekla Open API Reference for Tekla Structures 2025
ConnectiveGeometry Constructor
Overload List
Name | Description
ConnectiveGeometry(BendSurface)
 Initializes a new instance of the ConnectiveGeometry class for a stand-alone bend creation.
ConnectiveGeometry(Contour)
 Initializes a new instance of the ConnectiveGeometry class.
Top
See Also
Reference
ConnectiveGeometry Class
Tekla.Structures.Model Namespace